<a href="https://colab.research.google.com/github/youse0ng/AICE_/blob/main/AICE_02_%EB%8D%B0%EC%9D%B4%ED%84%B0_%ED%9A%8D%EB%93%9D%ED%95%98%EA%B8%B0.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# 01. 파이썬 데이터 분석 라이브러리
Numpy 와 Pandas

Numpy 수치 데이터 다루는데 활용하는 라이브러리

Pandas 데이터 배열이나 테이블 형태의 데이터 등의 자료구조를 처리하기 위한 라이브러리

판다스에서 많이 사용하는 자료구조는 시리즈와 데이터프레임이다
시리즈는 1차원으로 구성된 데이터 배열이고, 데이터 프레임은 행과 열로 이루어진 2차원 데이터 테이블이다.

In [2]:
# 눈여겨 볼것은
import pandas as pd
import numpy as np

a=np.array([1,2,3,4,5])
b=np.array(['대한민국','가나','포루투갈','우루과이'])
c=np.array([1,2,'가나','대한민국'])

print(c)
# c를 보면 ['1' '2' '가나' '대한민국']로 1,2가 문자열로 바꾸어져있다.

['1' '2' '가나' '대한민국']

In [3]:
a1=pd.DataFrame({"a":[1,2,3],"b":[4,5,6],"c":[7,8,9]})

a2=pd.DataFrame([[1,2,3],[4,5,6],[7,8,9]],["a",'b','c'])
print(a1) # 열로 만드는 데이터 프레임

print(a2) # 행으로 만드는 데이터 프레임

   a  b  c
0  1  4  7
1  2  5  8
2  3  6  9
   0  1  2
a  1  2  3
b  4  5  6
c  7  8  9

In [21]:
name=pd.DataFrame({'황유성':[25,'A',1],'박규태':[25,'B',1],'유주상':[25,'A',1],'양성훈':[25,'A',1]},index=['나이','혈액형','성별'])
name
# 딕셔너리로 만들 때, key는 데이터프레임에서 Column으로 바뀌고 value는 data로 들어감

    황유성 박규태 유주상 양성훈
나이   25  25  25  25
혈액형   A   B   A   A
성별    1   1   1   1

In [15]:
name1=pd.DataFrame([[1,2,3],[4,5,6],[7,8,9]],['a','b','c'],columns=['박규태','황유성','유주상'])
name1

   박규태  황유성  유주상
a    1    2    3
b    4    5    6
c    7    8    9

# 02. 데이터 불러오기

다양한 형태의 데이터를 불러오기 위해 pandas의 read_XXX 함수를 주로 사용한다.
ex) `read_csv`, `read_json`, `read_html` 등이 존재.

In [23]:
flight=pd.read_csv("Clean_Dataset.csv")
flight

,Unnamed: 0,airline,flight,source_city,departure_time,stops,arrival_time,destination_city,class,duration,days_left,price
0,0,SpiceJet,SG-8709,Delhi,Evening,zero,Night,Mumbai,Economy,2.17,1,5953
1,1,SpiceJet,SG-8157,Delhi,Early_Morning,zero,Morning,Mumbai,Economy,2.33,1,5953
2,2,AirAsia,I5-764,Delhi,Early_Morning,zero,Early_Morning,Mumbai,Economy,2.17,1,5956
3,3,Vistara,UK-995,Delhi,Morning,zero,Afternoon,Mumbai,Economy,2.25,1,5955
4,4,Vistara,UK-963,Delhi,Morning,zero,Morning,Mumbai,Economy,2.33,1,5955
...,...,...,...,...,...,...,...,...,...,...,...,...
300148,300148,Vistara,UK-822,Chennai,Morning,one,Evening,Hyderabad,Business,10.08,49,69265
300149,300149,Vistara,UK-826,Chennai,Afternoon,one,Night,Hyderabad,Business,10.42,49,77105
300150,300150,Vistara,UK-832,Chennai,Early_Morning,one,Night,Hyderabad,Business,13.83,49,79099
300151,300151,Vistara,UK-828,Chennai,Early_Morning,one,Evening,Hyderabad,Business,10.00,49,81585
300152,300152,Vistara,UK-822,Chennai,Morning,one,Evening,Hyderabad,Business,10.08,49,81585

# 03 데이터 저장하기

데이터 분석을 진행하다 보면 원래의 데이터를 가공하고 해당 데이터를 저장해야하는 경우가 발생한다.

데이터 가공 후에 데이터를 저장하는 방법을 알아본다.

Pandas에서 데이터를 저장할 때는 `to_csv` 함수를 이용한다.

In [24]:
a2=pd.DataFrame([[1,2,3],[4,5,6],[7,8,9]],['a','b','c'])
a2

#a2를 result_a2.csv파일로 저장하기
a2.to_csv('./result2_a2.csv')

# result2_a2.csv 읽어오기
result=pd.read_csv('./result2_a2.csv')
result

  Unnamed: 0  0  1  2
0          a  1  2  3
1          b  4  5  6
2          c  7  8  9

In [25]:
#read_csv함수가 가지는 다양한 파라미터를 이용하여 원하는 칼럼만 가지고 데이터 프레임 구성하기.
flight2=pd.read_csv("Clean_Dataset.csv",index_col='stops',usecols=['stops','departure_time','arrival_time','destination_city'])
# index_col: 인덱스로 설정할 칼럼을 정의, # usecols는 실제로 데이터 프레임에 불러올 칼럼들만 정의할 수 있다. usecols의 주의할 점은 index_col로 설정한 칼럼명을 반드시 포함해야함.
flight2

      departure_time   arrival_time destination_city
stops
zero         Evening          Night           Mumbai
zero   Early_Morning        Morning           Mumbai
zero   Early_Morning  Early_Morning           Mumbai
zero         Morning      Afternoon           Mumbai
zero         Morning        Morning           Mumbai
...              ...            ...              ...
one          Morning        Evening        Hyderabad
one        Afternoon          Night        Hyderabad
one    Early_Morning          Night        Hyderabad
one    Early_Morning        Evening        Hyderabad
one          Morning        Evening        Hyderabad

[300153 rows x 3 columns]

In [29]:
#`crosstab` 은 판다스 라이브러리에서 범주형 데이터 2개를 비교 분석할 때 사용

pd.crosstab(index=flight.source_city,columns=flight.arrival_time)

# 'source_city' 칼럼을 인덱스로 해서  도착 시간별 비행편이 얼마나 있는지 알려줌.

arrival_time  Afternoon  Early_Morning  Evening  Late_Night  Morning  Night
source_city
Bangalore          6992           3154    14493        2673    10411  14338
Chennai            5152           1606    10830        1999     7106  12007
Delhi              8007           5262    14630        2143    13007  18294
Hyderabad          4816           1581    10539        2092     8854  12924
Kolkata            5941           2156    11304        2414     9595  14937
Mumbai             7231           1658    16527        2680    13762  19038